tap "homebrew/bundle"
tap "homebrew/core"
brew "bat"
brew "cmake"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "nano"
brew "p7zip"
brew "pkgconf"
brew "pyenv"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "vnstat"
brew "watch"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "sublime-text"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "natqe.reload"
vscode "omthemes.omthemes"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "tamasfe.even-better-toml"
vscode "undefined_publisher.clsxify-transformer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
